/*
	기본 자료형:숫자형,문자열,불
	
	저장공간[=메모리 = 주기억장치 = RAM]
		*명령어[1,0]-> 명령어->프로세스->프로그램			메모리(컴퓨터 = 숫자를 좋아함)단독주택
	변수/상수 :  데이터 1개 저장할수 있는 공간					주소번지??
													식별 : 메모리 주소(번지)16진수
		1.변수 : 변하는 값	[let]	
							변수이름(문자)----->메모리주소(16진수)		
		2.상수 : 고정된 값	[const ]
	배열 : 데이터 여러개를 저장할수있는 공간	[값1,값2,값3 ]						
							배열이름(문자)------->메모리주소 (16진수)	아파트
										메모리->메모리1->메모리2
	연산자: 1산술연산자, 2비교연산자 ,3논리연산자 ,4대입연산자,5증감연산자 ,6삼항연산자						
					
	제어:if 
	반복:for				
					
					
					
					
								본체
						--------------------
							1.cpu : 명령어제어 / 연산/관리/해독 등
								레지스터 : 명령어들 임시 저장소
	
		a--------------->		10000001번역
	키보드/마우스-------입력---> 	2.주기억장치 메모리ram:현재 실행중인 프로그램 기억[명령어]
								영구저장x,변수
							3.보조기억장치 ssd	: 영구저장[]
								usb.c.cd.dvd.datebase
	모니터<---------------
						--------------------
  
 */